app/controllers/dashboard_controller.rb

SELECT "meals".* FROM "meals"
---
  def index
    @meal = Meal.all.sample