app/controllers/meals_controller.rb

  def index
    @meal = Meal.new
    @meals = Meal.all
---
SELECT "meals".* FROM "meals"

  def create
    @meal = Meal.new(meal_params)
    if @meal.save
---
INSERT INTO "meals" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Tacos"], ["created_at", "2021-06-09 01:08:06.392852"], ["updated_at", "2021-06-09 01:08:06.392852"]]

  def edit
    @meal = Meal.find(params[:id])
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def destroy
    @meal = Meal.find(params[:id])
    @meal.destroy
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 1]]